name: "finbert-tokenizer"
backend: "python"
max_batch_size: 16

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [-1]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT32
    dims: [-1]
  },
  {
    name: "token_type_ids"
    data_type: TYPE_INT32
    dims: [-1]
  }
]
